Arpit/asset_management/app/views/device_assignments/_form.html.haml

SELECT `branches`.* FROM `branches`
SELECT `device_categories`.* FROM `device_categories`
---
= bootstrap_form_for @device_assignment, layout: :horizontal, control_col: "col-sm-3", html: { class: 'validate-form' }  do |f|
  = f.collection_select :branch_id, Branch.all, :id, :name, {include_blank: 'Please Select',  label: "Branch<span class='required'/>".html_safe}, data: { 'rule-required' => true }, class: 'branch_select'
  = f.collection_select :device_category_id, DeviceCategory.all, :id, :name, { label: "Device Category<span class='required'/>".html_safe, include_blank: 'Please Select'}, data: { 'rule-required' => true }, class: 'category_select'