Arpit/asset_management/app/controllers/branches_controller.rb

SELECT `devices`.* FROM `devices`  WHERE `devices`.`branch_id` = 1 AND (`devices`.`status` != 'assigned') AND `devices`.`deleted_at` IS NULL
---
  def associate_data
    devices_condition = {}
    devices_condition[:device_category_id] = params[:device_category_id] if params[:device_category_id].present?
    respond_to do |format|
      format.json { render :json => {employees: @branch.employees.active, devices: @branch.devices.where(status: ['assigned', 'instock'], parent_id: nil).where(devices_condition).active} }

SELECT `branches`.* FROM `branches`  WHERE `branches`.`deleted_at` IS NULL
---
    def set_branch
      @branch = Branch.find(params[:id])