Arpit/asset_management/app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`  WHERE `clients`.`deleted_at` IS NULL
---
    def set_client
      @client = Client.find(params[:id])