Arpit/asset_management/app/controllers/device_requests_controller.rb

  def index
    @device_requests = DeviceRequest.all
---
SELECT `device_requests`.* FROM `device_requests`

  def edit
    @requested_transactions = @device_request.requested_transactions
    @device_request.vendor_ids = @device_request.device_transactions.map(&:vendor_id).uniq.compact||[]
---
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`device_request_id` = 1
SELECT `vendors`.* FROM `vendors`

  def create
    # render text: params.inspect and return false
    @device_request = DeviceRequest.new(device_request_params)
    respond_to do |format|
      if @device_request.save
---
INSERT INTO `device_requests` (`created_at`, `identifier`, `on_date`, `updated_at`) VALUES ('2014-07-24 13:56', 'REQ1', '2014-07-15', '2014-07-24 13:56')

  def destroy
    @device_request.destroy
---
DELETE FROM `device_requests` WHERE `device_requests`.`id` = 1

    def set_device_request
      @device_request = DeviceRequest.find(params[:id])
---
SELECT  `device_requests`.* FROM `device_requests`  WHERE `device_requests`.`id` = 8 LIMIT 1