Arpit/asset_management/app/controllers/devices_controller.rb

  def edit
    @parent_devices = (@device.branch.devices.where(parent_id: nil, status: ['assigned', 'instock']).active << @device.parent).compact.uniq
    redirect_to devices_path, alert: "You can't edit this device." if @device.deleted_at.present?
---
SELECT `devices`.* FROM `devices`  WHERE `devices`.`deleted_at` IS NULL AND `devices`.`parent_id` IS NULL AND (`devices`.`id` NOT IN (4))
SELECT  `devices`.* FROM `devices`  WHERE `devices`.`id` = 4 LIMIT 1
SELECT `branches`.* FROM `branches`  WHERE `branches`.`deleted_at` IS NULL

  def create
    params[:device].merge!(params[:device][:more_devices_attributes].first[1])  if params[:device][:more_devices_attributes].first
    params[:device][:more_devices_attributes].except!(params[:device][:more_devices_attributes].keys.first) if params[:device][:more_devices_attributes].first
    @device = Device.new(device_params)
    @device.status_date = Date.today
	  @device.status = @device.parent_id.present? ? @device.parent.status : 'instock'
    if Device.test_uniquness(params)
      respond_to do |format|
        if @device.save
---
SELECT `devices`.* FROM `devices`  WHERE `devices`.`deleted_at` IS NULL AND `devices`.`parent_id` IS NULL AND (`devices`.`id` IS NOT NULL)
INSERT INTO `devices` (`branch_id`, `created_at`, `device_category_id`, `device_identifier`, `ip_address`, `model_number`, `parent_id`, `provider`, `purchase_date`, `serial_number`, `status`, `status_date`, `updated_at`, `warranty`) VALUES (1, '2014-07-08 06:51:12', 3, 'New Device', '11.000.000.00', '65465465465465465465465465465465465', 1, 'Clarion', '2014-07-10', '56465165156165118716516151061651717', 'instock', '2014-07-07 18:30:00', '2014-07-08 06:51:12', '999')

  def update
    @device.status_date = Date.today
    respond_to do |format|
      @device.parent_id = device_params[:parent_id]
      device_attr = device_params
      device_attr[:status] = @device.parent.status if device_attr[:status].blank?
      device_attr[:branch_id] = @device.parent.branch_id if device_attr[:branch_id].blank?

      if @device.update(device_attr)
        if @device.status != 'assigned'
          @device.device_assignments.where(unassign_date: nil).update_all(unassign_date: DateTime.now)
---
UPDATE `devices` SET `purchase_date` = '2014-07-03', `status_date` = '2014-07-07 18:30:00', `updated_at` = '2014-07-08 06:58:00' WHERE `devices`.`id` = 4
UPDATE `device_assignments` SET `device_assignments`.`unassign_date` = '2014-07-08 06:58:00' WHERE (device_id = 4 AND unassign_date IS NULL)

    def set_device
      @device = Device.find(params[:id])
---
SELECT `devices`.* FROM `devices`  WHERE `devices`.`deleted_at` IS NULL