Arpit/asset_management/app/controllers/device_categories_controller.rb

SELECT `device_categories`.* FROM `device_categories`  WHERE `device_categories`.`deleted_at` IS NULL
---
    def set_device_category
      @device_category = DeviceCategory.find(params[:id])