Arpit/asset_management/app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`  WHERE `employees`.`deleted_at` IS NULL
---
    def set_employee
      @employee = Employee.find(params[:id])