Arpit/asset_management/app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
---
SELECT `invoices`.* FROM `invoices`

  def new
    if params[:purchase_order_id]
      @purchase_order = PurchaseOrder.find_by_id(params[:purchase_order_id])
      @device_transactions = @purchase_order.device_transactions
      @device_transactions.each do |po|
        po.invoice_title = po.purchase_title
        po.invoice_quantity = po.purchase_quantity
        po.invoice_price = po.purchase_price
        po.invoice_description = po.purchase_description
      end
    else
      @purchase_order = PurchaseOrder.new
    end
    @invoice = @purchase_order.build_invoice
    @uploads= @invoice.uploads.build
    @invoice.on_date = @purchase_order.blank? ? '' : @purchase_order.on_date
---
SELECT `purchase_orders`.* FROM `purchase_orders`  WHERE (`purchase_orders`.`id` NOT IN (1))
SELECT `invoices`.`purchase_order_id` FROM `invoices`
SELECT `purchase_orders`.* FROM `purchase_orders`  WHERE (1=1)

  def create
    @purchase_order = PurchaseOrder.find(params[:purchase_order_id])
    respond_to do |format|
      if @purchase_order.update(purchase_order_params)
        @purchase_order.device_transactions.update_all(invoice_id: @purchase_order.invoice.id)
---
SELECT  `purchase_orders`.* FROM `purchase_orders`  WHERE `purchase_orders`.`id` = 1 LIMIT 1
UPDATE `device_transactions` SET `invoice_description` = 'tst', `invoice_id` = 1, `invoice_price` = '222', `invoice_quantity` = '22', `invoice_title` = 'Mouse', `updated_at` = '2014-07-24 14:56' WHERE `device_transactions`.`id` = 14

  def update
    respond_to do |format|
      if @purchase_order.update(purchase_order_params)
        @purchase_order.device_transactions.update_all(invoice_id: @purchase_order.invoice.id)
        format.html { redirect_to @purchase_order.invoice, notice: 'Invoice was successfully updated.' }
        format.json { render :show, status: :ok, location: @purchase_order.invoice}
      else
        @invoice = @purchase_order.invoice
        @uploads= @invoice.uploads.blank? ?   @invoice.uploads.build : @invoice.uploads
---
SELECT  1 AS one FROM `invoices`  WHERE (`invoices`.`purchase_order_id` = BINARY 2 AND `invoices`.`id` != 2) LIMIT 1

    def set_purchase_orders
      purchase_order_ids = Invoice.select(:purchase_order_id).map(&:purchase_order_id)
---
SELECT `invoices`.`purchase_order_id` FROM `invoices`

    def set_invoice
      @invoice = Invoice.includes(:device_transactions).find(params[:id])
---
SELECT  `invoices`.* FROM `invoices`  WHERE `invoices`.`id` = 15 LIMIT 1
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`invoice_id` IN (15)