Arpit/asset_management/app/controllers/purchase_orders_controller.rb

SELECT `purchase_orders`.* FROM `purchase_orders`
---
  def index
    @purchase_orders = PurchaseOrder.all

SELECT `quotations`.* FROM `quotations`  WHERE (`quotations`.`id` NOT IN (1))
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` = 1
SELECT `purchase_orders`.`quotation_id` FROM `purchase_orders`
---
  def new
    if params[:quotation_id].present?
      @quotation = Quotation.find(params[:quotation_id])
      @device_transactions = @quotation.device_transactions
      @device_transactions.each do |po|
        po.purchase_title = po.quotation_title
        po.purchase_quantity = po.quotation_quantity
        po.purchase_price = po.quotation_price
        po.purchase_description = po.quotation_description
      end
      #@purchase_order.set_purchase_order(@device_transactions)
    else
      @quotation = Quotation.new
    end
    @purchase_order = @quotation.build_purchase_order
    @uploads =   @purchase_order.uploads.build
    @purchase_order.on_date = @quotation.blank? ? '' : @quotation.on_date

SELECT  `quotations`.* FROM `quotations`  WHERE `quotations`.`id` = 1 LIMIT 1
UPDATE `device_transactions` SET `purchase_description` = 'tst', `purchase_order_id` = 1, `purchase_price` = '222', `purchase_quantity` = '22', `purchase_title` = 'Mouse', `updated_at` = '2014-07-24 14:55' WHERE `device_transactions`.`id` = 14
---
  def create
    # render text: params.inspect and return false
    @quotation = Quotation.find(params[:quotation_id])
    respond_to do |format|
      if @quotation.update(quotation_params)
        @quotation.device_transactions.update_all(purchase_order_id: @quotation.purchase_order.id)

DELETE FROM `purchase_orders` WHERE `purchase_orders`.`id` = 1
---
  def destroy
    @purchase_order.destroy

SELECT  `purchase_orders`.* FROM `purchase_orders`  WHERE `purchase_orders`.`id` = 1 LIMIT 1
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`purchase_order_id` = 1
---
    def set_purchase_order
      @purchase_order = PurchaseOrder.includes(:device_transactions).find(params[:id])

SELECT `purchase_orders`.`quotation_id` FROM `purchase_orders`
---
    def set_quotations
      qid = PurchaseOrder.select(:quotation_id).map(&:quotation_id)