Arpit/asset_management/app/controllers/quotations_controller.rb

SELECT `quotations`.* FROM `quotations`
---
  def index
    @quotations = Quotation.all

SELECT `device_requests`.* FROM `device_requests`  WHERE `device_requests`.`id` IN (7)
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` IS NULL
---
  def new
    if params[:device_request_id]
      @device_request = DeviceRequest.find(params[:device_request_id])
      if @device_request
        vendor_ids = DeviceTransaction.where(device_request_id: params[:device_request_id], quotation_id: nil).map(&:vendor_id).uniq
        @vendors = Vendor.where(:id => vendor_ids)
        @device_transactions = @device_request.device_transactions.where(vendor_id: params[:vendor_id])
        @device_transactions.each do |po|

SELECT  `quotations`.* FROM `quotations`  WHERE `quotations`.`id` = 1 LIMIT 1
---
  def edit
    @device_request = Quotation.find(params[:id]).device_request

SELECT  `device_requests`.* FROM `device_requests`  WHERE `device_requests`.`id` = 7 LIMIT 1
SELECT  `quotations`.* FROM `quotations`   ORDER BY `quotations`.`id` DESC LIMIT 1
UPDATE `device_transactions` SET `quotation_description` = 'tst', `quotation_id` = 1, `quotation_price` = '222', `quotation_quantity` = '22', `quotation_title` = 'Mouse', `updated_at` = '2014-07-24 14:52' WHERE `device_transactions`.`id` = 14
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` IS NULL
---
  def create
    @device_request = DeviceRequest.find(params[:device_request_id])
    respond_to do |format|
      if @device_request.update(device_request_params)
        transactions = @device_request.device_transactions.where(vendor_id:  params[:vendor_id])
        transactions.update_all(quotation_id: @device_request.quotations.last.id)
        format.html { redirect_to @device_request.quotations.last, notice: 'Quotation was successfully created.' }
        format.json { render :show, status: :created, location: @device_request.quotations.last }
      else
        @quotation = @device_request.quotations.last
        vendor_ids = DeviceTransaction.where(device_request_id: params[:device_request_id], quotation_id: nil).map(&:vendor_id).uniq
        @vendors = Vendor.where(:id => vendor_ids)
        @quotation.vendor_id = params[:vendor_id]
        @device_transactions = @device_request.device_transactions.select{|transaction| transaction.vendor_id.to_s ==  params[:vendor_id]}

SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`device_request_id` = 7 AND `device_transactions`.`quotation_id` IS NULL
SELECT `vendors`.* FROM `vendors`  WHERE `vendors`.`id` IN (12, 10, 11)
---
  def request_vendors
    vendor_ids = DeviceTransaction.where(:device_request_id => params[:id], quotation_id: nil).map(&:vendor_id).uniq
    @vendors = Vendor.where(:id => vendor_ids)

SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`vendor_id` = 10 AND `device_transactions`.`device_request_id` = 7
---
  def get_requests
	@device_request = DeviceRequest.find(params[:device_request_id])
    @transactions = DeviceTransaction.where(vendor_id: params[:vendor_id], device_request_id: params[:device_request_id])

SELECT  `device_requests`.* FROM `device_requests`  WHERE `device_requests`.`id` = 7 LIMIT 1
SELECT  `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` = 1  ORDER BY `device_transactions`.`id` ASC LIMIT 1
SELECT  `quotations`.* FROM `quotations`  WHERE `quotations`.`id` = 1 LIMIT 1
---
    def set_quotation
      @quotation = Quotation.includes(:device_transactions, :device_request).find(params[:id])