Arpit/asset_management/app/controllers/software_products_controller.rb

    def set_software_product
      @software_product = SoftwareProduct.find(params[:id])
---
SELECT `software_products`.* FROM `software_products`  WHERE (`software_products`.`deleted_at` IS NOT NULL)