Arpit/asset_management/app/controllers/transfers_controller.rb

INSERT INTO `transfers` (`created_at`, `from_location_id`, `to_location_id`, `transfer_date`, `transferable_id`, `transferable_type`, `transferee_id`, `updated_at`) VALUES ('2014-07-08 06:58:06', 1, 2, '2014-07-08', 4, 'Device', 2, '2014-07-08 06:58:06')
---
  def create
    @transfer = Transfer.new(transfer_params)
    respond_to do |format|
      if @transfer.save

UPDATE `transfers` SET `transferable_id` = 2, `updated_at` = '2014-07-08 07:04:49' WHERE `transfers`.`id` = 5
UPDATE `devices` SET `devices`.`status` = 'instock', `devices`.`status_date` = '2014-07-08' WHERE `devices`.`employee_id` = 2
UPDATE `employees` SET `branch_id` = 2, `updated_at` = '2014-07-08 07:04:49' WHERE `employees`.`id` = 2
SELECT  `transfers`.* FROM `transfers`  WHERE `transfers`.`transferable_id` = 2 AND `transfers`.`transferable_type` = 'Employee' AND (id NOT IN (5)) AND (transfer_date < '2014-07-02')  ORDER BY `transfers`.`transfer_date` DESC LIMIT 1
---
  def update
    respond_to do |format|
      if @transfer.update(transfer_params)
        latest_transfer = Transfer.latest_transfer(@transfer.transferable_id, @transfer.transferable_type)
        if @transfer.transferable_type == "Employee" && @transfer.from_location != @transfer.transferable.branch
          @transfer.transferable.devices.update_all( status: "instock", status_date: Date.today )
          @transfer.transferable.device_assignments.where.not(unassign_date: nil).update_all(unassign_date: @transfer.transfer_date)

DELETE FROM `transfers` WHERE `transfers`.`id` = 1
---
  def destroy
    latest_transfer = Transfer.latest_transfer(@transfer.transferable_id, @transfer.transferable_type)
    @transfer.destroy

SELECT  `transfers`.* FROM `transfers`  WHERE `transfers`.`id` = 5 LIMIT 1
---
    def set_transfer
      @transfer = Transfer.find(params[:id])

SELECT  `devices`.* FROM `devices`  WHERE `devices`.`id` = 4 LIMIT 1
SELECT `branches`.* FROM `branches`  WHERE `branches`.`deleted_at` IS NULL
SELECT `employees`.* FROM `employees`  WHERE `employees`.`branch_id` = 2 AND (`employees`.`id` != 4)
---
    def set_resources
      @transferable_type, @branch_id, @transferable = @transfer.present? ? [@transfer.transferable_type, @transfer.from_location, @transfer.transferable] : [params[:resource], params[:id]]
      @resource = @transferable_type == "Employee" ? Employee.branch_employees(@branch_id, current_user.employee_id) : Device.unassigned.where(branch_id: @branch_id)