Arpit/asset_management/app/controllers/vendors_controller.rb

    def set_vendor
      @vendor = Vendor.find(params[:id])
---
SELECT `vendors`.* FROM `vendors`  WHERE `vendors`.`deleted_at` IS NULL