Arpit/asset_management/app/views/quotations/_form.html.haml

              .col-sm-7
                = @quotation.device_transactions.first.vendor.name
---
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` IS NULL