Arpit/asset_management/app/views/quotations/index.html.haml

SELECT  `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` = 1  ORDER BY `device_transactions`.`id` ASC LIMIT 1
---
        %td= link_to quotation.device_request.identifier, device_request_path(quotation.device_request.id)
        %td= quotation.device_transactions.map(&:quotation_title).uniq.join(', ')