Arpit/asset_management/app/views/quotations/show.html.haml

SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`id` = 10 LIMIT 1
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`quotation_id` IN (1)
---
    %td
      = @quotation.device_transactions.first.vendor.try(:name)