Arpit/asset_management/app/controllers/admin/users_controller.rb

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 4  ORDER BY `users`.`id` ASC LIMIT 1