Arpit/asset_management/app/views/devices/_devices.html.haml

        %td= device.branch.try(:name)
        %td= device.client.present? ? device.client.name : 'Clarion'
---
SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 1 LIMIT 1