Arpit/asset_management/app/views/devices/_form.html.haml

SELECT `devices`.* FROM `devices`  WHERE `devices`.`deleted_at` IS NULL AND `devices`.`parent_id` IS NULL AND (`devices`.`id` IS NOT NULL)
---
- edit_parent = @device.child_devices.size != 0