Arpit/asset_management/app/views/devices/show.html.haml

    %td
      = format_value (@device.client.present? ? @device.client.name : 'Clarion')
---
SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 2 LIMIT 1

  %tbody
    - @device.device_assignments.each do |assignment|
---
SELECT `device_assignments`.* FROM `device_assignments`  WHERE `device_assignments`.`device_id` = 5