Arpit/asset_management/app/views/branches/index.html.haml

    - @branches.each do |branch|
      - branch_assets_employees_size = branch.devices.active.size + branch.employees.active.size
---
SELECT COUNT(*) FROM `devices`  WHERE `devices`.`branch_id` = 1 AND `devices`.`deleted_at` IS NULL
SELECT COUNT(*) FROM `employees`  WHERE `employees`.`branch_id` = 1 AND `employees`.`deleted_at` IS NULL