sapna/tdd_exec/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `admin`, `created_at`, `updated_at`) VALUES ('Jerel Legros', 'developers2@clariontechnologies.co.in', 'p@ssw0rD', 0, '2015-05-19 10:53:29', '2015-05-19 10:53:29')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `name` = 'Sapna Prajapati', `email` = 'sapna.prajapati@clariontechnologies.co.in', `password` = 'p@ssw0rd', `updated_at` = '2015-05-19 11:51:59' WHERE `users`.`id` = 312

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 615

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 615 LIMIT 1