Arpit/asset_management/app/views/purchase_orders/index.html.haml

        %td= link_to purchase_order.quotation.identifier, purchase_order.quotation
        %td= purchase_order.device_transactions.map(&:purchase_title).uniq.join(', ')
---
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`purchase_order_id` = 1