Arpit/asset_management/app/views/purchase_orders/show.html.haml

SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`purchase_order_id` = 1
---
    - total = 0
    - @purchase_order.device_transactions.each do |t|