Arpit/asset_management/app/views/device_categories/index.html.haml

SELECT COUNT(*) FROM `devices`  WHERE `devices`.`device_category_id` = 1 AND `devices`.`deleted_at` IS NULL
SELECT COUNT(*) FROM `software_products`  WHERE `software_products`.`device_category_id` = 1 AND `software_products`.`deleted_at` IS NULL
---
        - unless params[:deleted]
          %td.text-center= device_count = device_category.devices.active.size
          %td.text-center= sw_count = device_category.software_products.active.size