Arpit/asset_management/app/views/invoices/show.html.haml

    - total_invoice_price = 0.0
    - @invoice.device_transactions.each do |t|
---
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`invoice_id` IN (15)