Arpit/asset_management/app/views/transfers/_form.html.haml

  - else
    = f.select :from_location_id, Branch.active.map{ |branch| [branch.name, branch.id] }, { prompt: 'Select Current Branch', label: "From Branch<span class='required'/>".html_safe}, data: { 'rule-required' => true, resource_name: @transfer.transferable_type}
---
SELECT `branches`.* FROM `branches`  WHERE `branches`.`deleted_at` IS NULL


  = f.select :transferee_id, Employee.active.map{ |employee| [employee.name, employee.id] }, { :include_blank => "Select Employee", label: "Transfer By<span class='required'/>".html_safe}, data: { 'rule-required' => true }
---
SELECT `employees`.* FROM `employees`  WHERE `employees`.`deleted_at` IS NULL