Arpit/asset_management/app/views/device_requests/_form.html.haml

SELECT `vendors`.* FROM `vendors`
---
    .col-md-5
      = f.collection_select :vendor_ids, Vendor.all, :id, :name, {label: "Vendor <span class='required'/>".html_safe},{ multiple: true, class: 'multiselect', data: {'rule-required' => true }}
    .col-md-5

SELECT `device_categories`.* FROM `device_categories`
---

            = t.collection_select :device_category_id, DeviceCategory.all, :id, :name, {label: "Category<span class='required'/>".html_safe, include_blank: 'Select Device Category'},data: {'rule-required' => true }