Arpit/asset_management/app/views/device_requests/index.html.haml

        %td= link_to device_request.identifier, device_request
        %td= device_request.device_transactions.map(&:request_title).uniq.join(', ')
---
SELECT `device_transactions`.* FROM `device_transactions`  WHERE `device_transactions`.`device_request_id` = 1