Arpit/asset_management/app/views/device_requests/show.html.haml

    %td
      = @device_request.vendors.uniq.map(&:name).join(', ')
---
SELECT `vendors`.* FROM `vendors` INNER JOIN `device_transactions` ON `vendors`.`id` = `device_transactions`.`vendor_id` WHERE `device_transactions`.`device_request_id` = 1